#Вывести квадрат числа
print((int(input('введите число: ')))**2)
