#Дана последовательность чисел. Получить список неповторяющихся элементов исходной последовательности
#Пример: [1, 2, 3, 5, 1, 5, 3, 10] => [1, 2, 3, 5, 10]
#1
lst = [4, 6, 4, 8, 546, 56, 23, 56, 332,45, 546]
lst2 = (list(set(lst))) #set = уникальный массив
lst2.sort()
print(lst2)

#2
# list1 = [8, 2, 3, 5, 9, 5, 38, 1, 2, 3, 38, 2, 7]
# list2 = []

# for i in list1:
#     count = 0
#     for j in list2:
#         if i == j:
#             count +=1
#     if count == 0: list2.append(i)
           
# list2.sort()
# print(list2)
